Revit 2024 API
BuiltInFailures.StairRampFailures.TreadDepthFailsEq Property
 The actual tread depth and riser height for one or more stairs of this type violates the stair equation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TreadDepthFailsEq { get; }
Visual Basic
Public Shared ReadOnly Property TreadDepthFailsEq As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TreadDepthFailsEq {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace